# GridType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
GridType Class
Members See Also
---
An object that represents a grid type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class GridType : LineAndTextAttrSymbol
```

Visual Basic
---
```text
Public Class GridType _
	Inherits LineAndTextAttrSymbol
```

Visual C++
---
```text
public ref class GridType : public LineAndTextAttrSymbol
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..LineAndTextAttrSymbol Autodesk.Revit.DB..::..GridType
# See Also
GridType Members
Autodesk.Revit.DB Namespace